Revit 2024 API
DuctPressureDropData.Velocity Property
 The velocity of the duct. Units: (ft/s).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Velocity { get; set; }
Visual Basic
Public Property Velocity As Double
	Get
	Set
Visual C++
public:
property double Velocity {
	double get ();
	void set (double value);
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace